OOP 리팩토링 및 gradle test 개선
